mtosi_1.1/tmf854/xml/notifications/objectCreation.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:nt1="vendor.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="vendor.v1 ../vendorSchema/vendorDefinitions.xsd tmf854.v1 ../../xsd/common/header.xsd tmf854.v1 ../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <header tmf854Version="1.0">
      <activityName>notify</activityName>
      <msgName>notify</msgName>
      <msgType>NOTIFICATION</msgType>
      <senderURI>/MTOSI/EMS01</senderURI>
      <destinationURI>/MTOSI/InventoryOS</destinationURI>
      <communicationPattern>Notification</communicationPattern>
      <communicationStyle>MSG</communicationStyle>
      <timestamp>20051004140305</timestamp>
    </header>
  </soap:Header>
  <soap:Body>
    <notify tmf854Version="1.0" extAuthor="JM" extVersion="1.01a">
      <topic>Inventory</topic>
      <message>
        <ObjectCreation>
          <eventInfo>
            <notificationId>0001234</notificationId>
            <objectName>
              <mdNm>A_DomainName</mdNm>
              <meNm>A_MEName</meNm>
            </objectName>
            <objectType>OT_MANAGED_ELEMENT</objectType>
            <osTime>20041106210627.3</osTime>
            <neTime>20041106210615.0</neTime>
            <edgePointRelated>false</edgePointRelated>
          </eventInfo>
          <vendorExtensions>
            <nt1:MyObjectCreationExtension>
              <nt1:ptpAtt1>string</nt1:ptpAtt1>
              <nt1:ptpAtt2>false</nt1:ptpAtt2>
            </nt1:MyObjectCreationExtension>
          </vendorExtensions>
        </ObjectCreation>
      </message>
    </notify>
  </soap:Body>
</soap:Envelope>
